#  Introduction to Ensembling/Stacking in Python
https://www.kaggle.com/arthurtok/introduction-to-ensembling-stacking-in-python

refernece:https://www.kaggle.com/mmueller/stacking-starter

https://www.kaggle.com/sinakhorami/titanic-best-working-classifier

In [2]:
print("hello,ensemble")

hello,ensemble

In [12]:
dp="./input/"
import os
import pandas as pd
import numpy as np

In [15]:
train=pd.read_csv(os.path.join(dp,"train.csv"),dtype={"Age":np.float})
test=pd.read_csv(os.path.join(dp,"test.csv"),dtype={"Age":np.float})
print("train shape:{}".format(train.shape))
print("test shape:{}".format(test.shape))
print(train.info())

train shape:(891, 12)
test shape:(418, 11)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB
None

In [14]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [11]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [20]:
#Pclass,class=1>class=2>class=3
print(train.loc[:,["Pclass","Survived"]].groupby("Pclass",as_index=False).mean())

print("===================")
#sex
print(train.loc[:,["Sex","Survived"]].groupby("Sex",as_index=False).mean())

   Pclass  Survived
0       1  0.629630
1       2  0.472826
2       3  0.242363
===================
      Sex  Survived
0  female  0.742038
1    male  0.188908

In [25]:
fulldata=[train,test]
for dataset in fulldata:
    dataset["FamilySize"]=dataset["SibSp"]+dataset["Parch"]+1
print (train[['FamilySize', 'Survived']].groupby(['FamilySize'], as_index=False).mean())

   FamilySize  Survived
0           1  0.303538
1           2  0.552795
2           3  0.578431
3           4  0.724138
4           5  0.200000
5           6  0.136364
6           7  0.333333
7           8  0.000000
8          11  0.000000

In [27]:
for dataset in fulldata:
    dataset["isAlone"]=0
    dataset.loc[dataset.FamilySize==1,"isAlone"]=1
print(train[["isAlone","Survived"]].groupby("isAlone",as_index=False).mean())

   isAlone  Survived
0        0  0.505650
1        1  0.303538

In [30]:
for dataset in fulldata:
    dataset["Embarked"]=dataset["Embarked"].fillna("S")
    
print(train[["Embarked","Survived"]].groupby("Embarked",as_index=False).mean())

  Embarked  Survived
0        C  0.553571
1        Q  0.389610
2        S  0.339009

In [32]:
for dataset in fulldata:
    dataset["Fare"]=dataset["Fare"].fillna(dataset.Fare.median())
    dataset["CatogoricalFare"]=pd.qcut(dataset["Fare"],4)
print(train[["CatogoricalFare","Survived"]].groupby("CatogoricalFare",as_index=False).mean())

   CatogoricalFare  Survived
0   (-0.001, 7.91]  0.197309
1   (7.91, 14.454]  0.303571
2   (14.454, 31.0]  0.454955
3  (31.0, 512.329]  0.581081